# Insiders Clustering Project

# 0.0 General Area

## 0.1 Imports

In [1]:
import pandas  as pd
import numpy   as np
import seaborn as sns
import inflection
import warnings

from matplotlib          import pyplot as plt

## 0.2 Support Functions

In [2]:
# data description functions
def numerical_attributes( df ):
    df_num_attributes = df.select_dtypes( include=['int64', 'float64'] )

    # Central Tendency - mean, median
    df_mean   = pd.DataFrame( df_num_attributes.apply( np.mean ) ).T
    df_median = pd.DataFrame( df_num_attributes.apply( np.median ) ).T
    
    # Dispersion - min, max, range, std, skew, kurtosis
    df_min =      pd.DataFrame( df_num_attributes.apply( np.min ) ).T
    df_max =      pd.DataFrame( df_num_attributes.apply( np.max ) ).T
    df_range =    pd.DataFrame( df_num_attributes.apply( lambda x: x.max() - x.min() ) ).T
    df_std =      pd.DataFrame( df_num_attributes.apply( np.std ) ).T
    df_skew =     pd.DataFrame( df_num_attributes.apply( lambda x: x.skew() ) ).T
    df_kurtosis = pd.DataFrame( df_num_attributes.apply( lambda x: x.kurtosis() ) ).T
    
    # concatenate dataframes
    df_numerical = pd.concat( [df_min, df_max, df_range, df_mean, df_median, df_std, df_skew, df_kurtosis] ).T.reset_index()
    df_numerical.columns =  ['attributes', 'min', 'max', 'range', 'mean', 'median', 'std', 'skew', 'kurtosis'] 
    df_numerical
    
    return df_numerical

def categorical_attributes( df ):
    df_categorical = df.select_dtypes( exclude=['int64', 'float64', 'datetime64[ns]'] )

    return df_categorical
    
# data cleaning functions
def rename_columns( df ):
    title = lambda x: inflection.titleize( x )
    snakecase = lambda x: inflection.underscore( x )
    spaces = lambda x: x.replace(" ", "")

    cols_old = list( df.columns )
    cols_old = list( map( title, cols_old ) )
    cols_old = list( map( spaces, cols_old ) )
    cols_new = list( map( snakecase, cols_old ) )
    
    df.columns = cols_new

    df = df.rename( columns = {'customer' : 'customer_id' } )

    return df

def jupyter_settings():
    %matplotlib inline
    #%pylab inline

    plt.style.use( 'bmh' )
    plt.rcParams['figure.figsize'] = [25, 12]
    plt.rcParams['font.size'] = 24

    #display( HTML( '<style>.container { width:100% !important; }</style>') )

    pd.options.display.max_columns = None
    pd.options.display.max_rows = None
    pd.set_option( 'display.expand_frame_repr', False )

    sns.set()

jupyter_settings()
warnings.filterwarnings( 'ignore' )

## 0.3 Load Data

In [3]:
df_raw = pd.read_csv( '../data/Ecommerce.csv', low_memory=False, encoding='latin1')
df_raw.head()

  InvoiceNo StockCode                          Description  Quantity InvoiceDate  UnitPrice  CustomerID         Country  Unnamed: 8
0    536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER         6   29-Nov-16       2.55     17850.0  United Kingdom         NaN
1    536365     71053                  WHITE METAL LANTERN         6   29-Nov-16       3.39     17850.0  United Kingdom         NaN
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER         8   29-Nov-16       2.75     17850.0  United Kingdom         NaN
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6   29-Nov-16       3.39     17850.0  United Kingdom         NaN
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.         6   29-Nov-16       3.39     17850.0  United Kingdom         NaN

# 1.0 Data Description

In [4]:
df1 = df_raw.copy()

## 1.1 Data Dimension

In [5]:
print(f'Number of rows: { df1.shape[0] } ')
print(f'Number of cols: { df1.shape[1] } ')

Number of rows: 541909
Number of cols: 9

## 1.2 List Data Types

In [6]:
df1.dtypes

InvoiceNo       object
StockCode       object
Description     object
Quantity         int64
InvoiceDate     object
UnitPrice      float64
CustomerID     float64
Country         object
Unnamed: 8     float64
dtype: object

## 1.3 Descriptive Statistics

In [7]:
# identify and separate numerical and categorical attrributes
df_numerical   = numerical_attributes( df1 )
df_categorical = categorical_attributes( df1 )

### 1.3.1 Numerical Attributes

In [8]:
df_numerical.head()

   attributes       min      max      range          mean  median          std        skew       kurtosis
0    Quantity -80995.00  80995.0  161990.00      9.552250    3.00   218.080957   -0.264076  119769.160031
1   UnitPrice -11062.06  38970.0   50032.06      4.611114    2.08    96.759764  186.506972   59005.719097
2  CustomerID  12346.00  18287.0    5941.00  15287.690570     NaN  1713.598197    0.029835      -1.179982
3  Unnamed: 8       NaN      NaN        NaN           NaN     NaN          NaN         NaN            NaN

### 1.3.2 Categorical Attributes

In [9]:
df_categorical.head()

  InvoiceNo StockCode                          Description InvoiceDate         Country
0    536365    85123A   WHITE HANGING HEART T-LIGHT HOLDER   29-Nov-16  United Kingdom
1    536365     71053                  WHITE METAL LANTERN   29-Nov-16  United Kingdom
2    536365    84406B       CREAM CUPID HEARTS COAT HANGER   29-Nov-16  United Kingdom
3    536365    84029G  KNITTED UNION FLAG HOT WATER BOTTLE   29-Nov-16  United Kingdom
4    536365    84029E       RED WOOLLY HOTTIE WHITE HEART.   29-Nov-16  United Kingdom

# 2.0 Data Cleaning

In [10]:
df2 = df1.copy()

## 2.1 Rename Columns

In [11]:
df2 = rename_columns( df2 )
df2.head()

  invoice_no stock_code                          description  quantity invoice_date  unit_price  customer_id         country  unnamed:8
0     536365     85123A   WHITE HANGING HEART T-LIGHT HOLDER         6    29-Nov-16        2.55      17850.0  United Kingdom        NaN
1     536365      71053                  WHITE METAL LANTERN         6    29-Nov-16        3.39      17850.0  United Kingdom        NaN
2     536365     84406B       CREAM CUPID HEARTS COAT HANGER         8    29-Nov-16        2.75      17850.0  United Kingdom        NaN
3     536365     84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6    29-Nov-16        3.39      17850.0  United Kingdom        NaN
4     536365     84029E       RED WOOLLY HOTTIE WHITE HEART.         6    29-Nov-16        3.39      17850.0  United Kingdom        NaN

## 2.1 Drop Columns

In [12]:
df2 = df2.drop( 'unnamed:8', axis=1 )
df2.head()

  invoice_no stock_code                          description  quantity invoice_date  unit_price  customer_id         country
0     536365     85123A   WHITE HANGING HEART T-LIGHT HOLDER         6    29-Nov-16        2.55      17850.0  United Kingdom
1     536365      71053                  WHITE METAL LANTERN         6    29-Nov-16        3.39      17850.0  United Kingdom
2     536365     84406B       CREAM CUPID HEARTS COAT HANGER         8    29-Nov-16        2.75      17850.0  United Kingdom
3     536365     84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6    29-Nov-16        3.39      17850.0  United Kingdom
4     536365     84029E       RED WOOLLY HOTTIE WHITE HEART.         6    29-Nov-16        3.39      17850.0  United Kingdom

## 1.3 Check N/A

In [13]:
# number of rows with NA values by column
df2.isna().sum()

invoice_no           0
stock_code           0
description       1454
quantity             0
invoice_date         0
unit_price           0
customer_id     135080
country              0
dtype: int64

## 1.4 Fillout N/A

In [14]:
#df1['description'].fillna( 'Undefined', inplace=True )
#df1['customer'].fillna( 10000, inplace=True )

## 1.5 Drop N/A Values

In [15]:
df2 = df2.dropna( subset = ['description', 'customer_id'] )

print(f'Removed data : { round( 1 - ( df2.shape[0] / df_raw.shape[0] ), 2) } ') 
print(f'Number of rows Updated: { df2.shape[0] } ')

Removed data : 0.25
Number of rows Updated: 406829

## 1.6 Change Data Types

In [16]:
df2['invoice_date'] = pd.to_datetime( df2['invoice_date'] )
df2.head()

  invoice_no stock_code                          description  quantity invoice_date  unit_price  customer_id         country
0     536365     85123A   WHITE HANGING HEART T-LIGHT HOLDER         6   2016-11-29        2.55      17850.0  United Kingdom
1     536365      71053                  WHITE METAL LANTERN         6   2016-11-29        3.39      17850.0  United Kingdom
2     536365     84406B       CREAM CUPID HEARTS COAT HANGER         8   2016-11-29        2.75      17850.0  United Kingdom
3     536365     84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6   2016-11-29        3.39      17850.0  United Kingdom
4     536365     84029E       RED WOOLLY HOTTIE WHITE HEART.         6   2016-11-29        3.39      17850.0  United Kingdom

# 3.0 Feature Engineering

In [17]:
df3 = df2.copy()

In [18]:
# creating gross revenue
df3['gross_revenue'] = df3['quantity'] * df3['unit_price']

In [19]:
df3.head()

  invoice_no stock_code                          description  quantity invoice_date  unit_price  customer_id         country  gross_revenue
0     536365     85123A   WHITE HANGING HEART T-LIGHT HOLDER         6   2016-11-29        2.55      17850.0  United Kingdom          15.30
1     536365      71053                  WHITE METAL LANTERN         6   2016-11-29        3.39      17850.0  United Kingdom          20.34
2     536365     84406B       CREAM CUPID HEARTS COAT HANGER         8   2016-11-29        2.75      17850.0  United Kingdom          22.00
3     536365     84029G  KNITTED UNION FLAG HOT WATER BOTTLE         6   2016-11-29        3.39      17850.0  United Kingdom          20.34
4     536365     84029E       RED WOOLLY HOTTIE WHITE HEART.         6   2016-11-29        3.39      17850.0  United Kingdom          20.34

In [20]:
# creating customers dataframe
df_customer = df3.drop( columns= ['invoice_no', 'stock_code', 'description', 'quantity', 
                                  'invoice_date', 'unit_price', 'country', 'gross_revenue'], axis=1).drop_duplicates( ignore_index=True )
df_customer.head()

   customer_id
0      17850.0
1      13047.0
2      12583.0
3      13748.0
4      15100.0

In [21]:
# creating customer monetary dataframe
df_monetary = ( df3[['customer_id', 'gross_revenue']].
                        groupby('customer_id').
                        sum().
                        reset_index() )
df_monetary.head()

   customer_id  gross_revenue
0      12346.0           0.00
1      12347.0        4310.00
2      12348.0        1797.24
3      12349.0        1757.55
4      12350.0         334.40

In [22]:
# creating number of purchases dataframe by customer
df_frequency = ( df3[['customer_id', 'invoice_no']].
                        groupby('customer_id').
                        nunique().
                        reset_index().
                        rename( columns={ 'invoice_no' : 'purchase_frequency' } ) )
df_frequency.head()

   customer_id  purchase_frequency
0      12346.0                   2
1      12347.0                   7
2      12348.0                   4
3      12349.0                   1
4      12350.0                   1

In [23]:
# creating number of purchases dataframe by customer
max_invoice_date = df3['invoice_date'].max()

df_recency = ( df3[['customer_id', 'invoice_date']].
                        groupby('customer_id').
                        max().
                        reset_index().
                        rename( columns={ 'invoice_date' : 'last_purchase' } ) )

df_recency['recency_days'] =  ( max_invoice_date - df_recency['last_purchase'] ).dt.days
df_recency = df_recency.drop( 'last_purchase', axis=1 )
df_recency.head()

   customer_id  recency_days
0      12346.0           325
1      12347.0             2
2      12348.0            75
3      12349.0            18
4      12350.0           310

In [24]:
# creating average ticket by customer dataframe
df_avg_ticket = ( df3[['customer_id', 'gross_revenue']].
                        groupby('customer_id').
                        mean().
                        reset_index().
                        rename( columns={ 'gross_revenue' : 'average_ticket' } ) )

df_avg_ticket.head()

   customer_id  average_ticket
0      12346.0        0.000000
1      12347.0       23.681319
2      12348.0       57.975484
3      12349.0       24.076027
4      12350.0       19.670588

In [25]:
# merging dataframes by customer
df3 = pd.merge( df_customer, df_recency, how='left', on='customer_id' )
df3 = pd.merge( df3, df_frequency, how='left', on='customer_id' )
df3 = pd.merge( df3, df_monetary, how='left', on='customer_id' )
df3 = pd.merge( df3, df_avg_ticket, how='left', on='customer_id' )

df3.head()

   customer_id  recency_days  purchase_frequency  gross_revenue  average_ticket
0      17850.0           302                  35        5288.63       16.950737
1      13047.0            31                  18        3079.10       15.709694
2      12583.0             2                  18        7187.34       28.634821
3      13748.0            95                   5         948.25       33.866071
4      15100.0           330                   6         635.10      105.850000

# 4.0 Exploratory Data Analysis

In [26]:
df4 = df3.copy()

# 5.0 Data Preparation

In [27]:
df5 = df4.copy()

# 6.0 Feature Selection

In [28]:
df6 = df5.copy()

# 7.0 Hyperparameter Fine-Tuning

In [29]:
df7 = df6.copy()

# 8.0 Model Training

In [30]:
df8 = df7.copy()

# 9.0 Cluster Analysis

In [31]:
df9 = df8.copy()